-- 吟游诗人纹章数据
-- 来源: https://calamity.fandom.com/zh/wiki/吟游诗人纹章

INSERT INTO seal (name, class_name, branch, seal_type, effect, how_to_get, notes) VALUES
-- 普通-传奇 万象纹章
('余烬之温', '吟游诗人', '吟游纹章', '万象纹章', '火球术在命中敌人后,将使其陷入灼烧状态持续3秒,每秒造成16%/24%/32%/40%/48%Spell power', '-', ''),
('烈焰迸发', '吟游诗人', '吟游纹章', '万象纹章', '火球术在命中敌人后;将留下一块不稳定区域,延迟1.5秒后,该区域迸发出一道烈焰,对被迸发的烈焰命中的敌人造成70%/105%/140%/175%/210%Spell power', '-', ''),
('协调', '吟游诗人', '吟游纹章', '万象纹章', '治愈之音将为友军在5秒内恢复5%/7.5%/10%/12.5%/15%法力值/架势', '-', ''),
('救赎', '吟游诗人', '吟游纹章', '万象纹章', '治愈之音对血量低于60%的单位额外回复40%/60%/80%/100%/140%Spell power生命值', '-', ''),

-- 极品-传奇 万象纹章
('双重投掷', '吟游诗人', '吟游纹章', '万象纹章', '投掷两枚冰枪,第二枚命中的目标造成40%/120%/210%Spell power,若两枚冰枪命中同一名敌人,则使范围内敌人禁锢,持续1秒', '-', ''),

-- 史诗-传奇 万象纹章
('灵魂链接', '吟游诗人', '吟游纹章', '万象纹章', '治愈之音将为友军添加灵魂链接状态,持续10/40秒,持续期间内演奏的效果,将波及周围50格范围内具有灵魂链接的目标', '-', ''),
('复苏韵律', '吟游诗人', '吟游纹章', '万象纹章', '治愈之音在目标区域生成一片场地，每秒回复处于（10）其中的友军40%/60%Spell power生命值，持续8秒', '-', ''),
('飓风舞', '吟游诗人', '吟游纹章', '万象纹章', '掀起一阵狂风，席卷（8）前方的敌人至多攻击12次，每次36%/56%Spell power', '-', ''),
('潮海之歌', '吟游诗人', '吟游纹章', '万象纹章', '演奏潮汐之歌，使周围友军所有技能减少3s/5s冷却（无法减少"终之乐章"的冷却时间）', '-', ''),
('海韵歌谣', '吟游诗人', '吟游纹章', '万象纹章', '浪涛之音转为召唤一座人鱼雕像，持续10秒，在此期间力，每秒对周围（10）敌人造成30%/50%Spell power伤害，并对其施加2%/4%的易伤效果，持续2秒。在雕像周围（10）的友军则会受到祝福，每秒回复4加上0.6%/1%的法力值/架势', '-', ''),
('焰舞华彩', '吟游诗人', '吟游纹章', '万象纹章', '烈火之音的演奏将追加一次火花爆炸，对范围(7)敌人造成300%/500%Spell power伤害，并为自身及周围(7)最近1名友军施加6%/10%的伤害提升属性，持续8秒', '-', ''),
('协奏震击', '吟游诗人', '吟游纹章', '万象纹章', '将音符演奏后，产生对应余音效果，持续5秒，存在余音时释放雷霆之音，将根据余音种类产生效果：治愈-狂野生长：回复自身90%/180%Spell power生命，并使周围(15)友军提高1%/1.5%Spell power与物理攻击，持续8秒。狂风-离子护盾：为周围(15)友军添加一层护盾，护盾值相当于30%/60%Spell power，持续8秒。浪涛-激荡：留下一处不稳定区域，短暂延迟后迸发，对周围(7)敌人造成400%/700%Spell power伤害，处于其中的友军则回复7%最大法力/架势。烈火-狂热节拍：立即减少40%/70%烈火之音的剩余冷却时间。该纹章法力回复、提供的属性不随技能等级提升', '-', ''),
('共鸣剑斩', '吟游诗人', '吟游纹章', '万象纹章', '勇气之歌将为友军凝聚一柄存在8秒的共鸣之剑，友军翻滚时共鸣之剑飞向其周围(25)生命值最高的一名敌人位置，随后进行5次斩击，对范围(4)敌人每次造成等同于吟游诗人%/36%Spell power伤害', '-', '');
